"""
1707번 문제

그래프의 정점의 집합을 둘로 분할하여, 각 집합에 속한 정점끼리는 서로 인접하지 않도록 분할할 수 있을 때, 
그러한 그래프를 특별히 이분 그래프 (Bipartite Graph) 라 부른다.
그래프가 입력으로 주어졌을 때, 이 그래프가 이분 그래프인지 아닌지 판별하는 프로그램을 작성하시오.

입력은 여러 개의 테스트 케이스로 구성되어 있는데, 첫째 줄에 테스트 케이스의 개수 K가 주어진다. 
각 테스트 케이스의 첫째 줄에는 그래프의 정점의 개수 V와 간선의 개수 E가 빈 칸을 사이에 두고 순서대로 주어진다. 
각 정점에는 1부터 V까지 차례로 번호가 붙어 있다. 이어서 둘째 줄부터 E개의 줄에 걸쳐 간선에 대한 정보가 주어지는데, 
각 줄에 인접한 두 정점의 번호 u, v (u ≠ v)가 빈 칸을 사이에 두고 주어진다. 

K개의 줄에 걸쳐 입력으로 주어진 그래프가 이분 그래프이면 YES, 아니면 NO를 순서대로 출력한다.

현우 해석 :
-> 무엇보다 테스크 갯수가 여러개인 케이스
-> 간선이 정해진 케이스
-> 이분 그래프인지 증명하기 위해서는 DFS를 사용해야한다.
-> 정점번호의 시작이 0이 아닌 1부터 시작하는 경우에 해당.😣😣😣😣
-> visited를 boolean이 아닌 어떤 값을 담아서 사용하는 케이스 😣😣😣😣
-> 그냥 개많이 풀어봐야할듯
"""
import sys
sys.setrecursionlimit(10**6)
input = sys.stdin.readline

k = int(input())
def DFS(start, visited, graph, group):
    visited[start] = group  # 현재 노드의 그룹 저장
    # 인접 노드 탐색
    for v in graph[start]:
        if visited[v] == 0:  # 아직 방문하지 않은 노드
            # -group : 현재 노드의 그룹과 다른 값 전달
            result = DFS(v, visited, graph, -group)
            if not result:
                return False
        else:
            if visited[v] == group:  # 이미 방문한 곳 중에서 노드가 현재 그룹과 같으면 이분 그래프가 아님
                return False
    return True

for _ in range(k):
    # graph 생성
    V, E = map(int, input().split())
    graph = [[] for _ in range(V+1)]
    visited = [0] * (V+1)
    
    # 그래프를 인접 리스트 방식으로 표현하였습니다.
    for _ in range(E):
        a, b = map(int, input().split())
        graph[a].append(b)
        graph[b].append(a)

    for i in range(1, V+1):
        if visited[i] == 0:
            result = (DFS(i, visited, graph, 1))
            if not result: # 이게 정말 중요한 부분이다. for문을 돌면서 하나라도 False가 나오면 바로 NO를 출력해야한다.
                break
            
    print("YES") if result else print("NO")

        
    
        
    